In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series([0,1,2], index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = Series([4,5,6,7], index = ['A','B','D','E'])
ser2

A    4
B    5
D    6
E    7
dtype: int64

In [4]:
ser1 + ser2

A    4.0
B    6.0
C    NaN
D    NaN
E    NaN
dtype: float64

In [5]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index =('NYC','LA','FC'), columns = list('ADE'))
dframe1

     A  D  E
NYC  0  1  2
LA   3  4  5
FC   6  7  8

In [6]:
dframe2 =  DataFrame(np.arange(4).reshape((2,2)), index =('LA','FC'), columns = list('AB'))
dframe2

    A  B
LA  0  1
FC  2  3

In [7]:
dframe1 + dframe2

       A   B   D   E
FC   8.0 NaN NaN NaN
LA   3.0 NaN NaN NaN
NYC  NaN NaN NaN NaN

In [9]:
dframe1.add(dframe2, fill_value=0)

       A    B    D    E
FC   8.0  3.0  7.0  8.0
LA   3.0  1.0  4.0  5.0
NYC  0.0  NaN  1.0  2.0

In [10]:
dframe1

     A  D  E
NYC  0  1  2
LA   3  4  5
FC   6  7  8

In [11]:
dframe2

    A  B
LA  0  1
FC  2  3

In [23]:
ser3 = dframe1.loc['NYC']
ser3

A    0
D    1
E    2
Name: NYC, dtype: int32

In [24]:
dframe1 - ser3

     A  D  E
NYC  0  0  0
LA   3  3  3
FC   6  6  6